myamazum/stampfly_ecosystem/firmware/vehicle_old/components/sf_hal_bmi270/examples/development/stage1_spi_basic/sdkconfig.defaults
# ESP32-S3 Configuration for BMI270 Stage 1 Test

# Target configuration
CONFIG_IDF_TARGET="esp32s3"

# Component config
CONFIG_FREERTOS_HZ=1000

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# SPI Configuration
CONFIG_SPI_MASTER_IN_IRAM=n
CONFIG_SPI_MASTER_ISR_IN_IRAM=n

# ESP32-S3 specific
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
